{"test_data":[{"entities":{"location":[{"suggested":true,"confidence":0.90313,"value":"Paris's","type":"value"}]},"msg_id":"15a6t9Zg1oj0R5ulB","name":"BBC News","title":"4,816,900 followers","profile":"https://www.linkedin.com/company/1765/?miniCompanyUrn=urn%3Ali%3Afs_miniCompany%3A1765","post":"Why mushroom farms are sprouting up in Paris's underground car parks. 🍄 \n\n"},{"name":"John Stone","title":"Director at: Stone Tyres Ltd, Gorilla Tyres Ltd Stone Property Solutions Ltd Independent Tyre Fitters Alliance","profile":"https://www.linkedin.com/in/john-stone-41b724115?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAABzC41cBJlTTun3rnBaoLRp0ZQYIFhC6lCs","post":"LinkedIn friends.\nI'm after a car...\nCurrently in a gas guzzling Q7 s line 3.0 v6 diesel.\nWas looking at getting an all electric car for the tax benefits as a director but after viewing the I pace and e tron I'm left very un impressed and dont want to spend a mint on a tesla\nWith that in mind I'm looking for a nice merc possibly eclass, bmw 4 series or nice audi.\nHave seen posts mention as little as 1 and 2 year leases. This will be perfect as by then more electric cars will be out.\nMust be diesel, (or hybrid?) either white or black. Auto and 4 doors.\nNot looking to um and ah on this either want the new car Rapids something physically in stock...\nWhat's out there...\n"},{"entities":{"action":[{"confidence":1,"value":"lease a car","type":"value"}],"start_of_lease":[{"confidence":0.90159886822703,"value":"immediately","type":"value"}],"current_lease_ends":[{"confidence":0.96704270073883,"value":"mine goes back at the end of the month","type":"value"}],"intent":[{"confidence":0.98371675360872,"value":"renew_lease"}]},"msg_id":"1gEjh2tuiIOTFElbj","name":"Ryan Hole","title":"Restaurants. Bars. Property.","profile":"https://www.linkedin.com/in/ryan-hole-6631ba43?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAkbPisBq83i_nnbSMr00IEusb-KXYfzsuo","post":"Need to lease a car immediately as mine goes back at the end of the month. \n\nCan anyone help? Would like to keep it local if possible"},{"entities":{"recommendations":[{"confidence":0.94442863018008,"value":"recommend any contacts","type":"value"}],"potential_companies":[{"confidence":0.94313413350241,"value":"car leasing companies","type":"value"}],"connections":[{"confidence":1,"value":"feel free to tag them","type":"value"}],"intent":[{"confidence":0.99914689301109,"value":"leasing_cars"}]},"msg_id":"1PvqAcn0Jaz5RbEjq","name":"Sean White","title":"Director","profile":"https://www.linkedin.com/in/sean-white-911a1b16?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAANauF0B5JHRb0hG-v1IN6Dq1hzFwDxAluY","post":"If anyone can recommend any contacts they may have at car leasing companies, feel free to tag them!"},{"entities":{"connections":[{"confidence":1,"value":"Looking","type":"value"}],"location":[{"confidence":0.93556,"value":"Park City, UT","resolved":{"values":[{"name":"Park City","grain":"locality","type":"resolved","timezone":"America/Denver","coords":{"lat":40.646060943604,"long":-111.49797058105},"external":{"geonames":"5779451","wikidata":"Q482993","wikipedia":"Park City, Utah"}},{"name":"City of Park City","grain":"region","type":"resolved","timezone":"America/Denver","coords":{"lat":40.645851135254,"long":-111.50382232666},"external":{"geonames":"11788541"}}]}}]},"msg_id":"1p2cFM6OzncASiq6P","name":"Chris Carrabba","title":"Regional Liability Manager @ ELCO Claims Services","profile":"https://www.linkedin.com/in/chris-carrabba-2480182a?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAYNqFgBhBDGuXQEAIwWdKazC8GTyVDueWc","post":"We're looking to fill a Car Washer Park City position in Park City, UT"},{"name":"Hermann Brumm","title":"Remain humble, maintain a constant willingness to learn, and pursue righteously. The rest will follow.","profile":"https://www.linkedin.com/in/hermannbrumm?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAmAZ_MBN0ze5QlTCix1krxwkwjdMslhlGk","post":"Car Geeks is a reputable auto brokerage based in Los Angeles that I believe in firmly and have brought to Las Vegas. Whether leasing or purchasing, our clients simply select the vehicle they are interested in and we retrieve it for them. No time is wasted at a dealership and we go to bat for you to negotiate bottom line prices. Vehicles can be picked up at either location or delivered directly to you. Most importantly, our services are entirely free as our broker's fee is charged to the dealerships and not our clients. "},{"name":"TOM PANOS","title":"Real Estate Influencer | Real Estate Trainer | Real Estate Coach | Auctioneer | Author | Public Speaker","profile":"https://www.linkedin.com/in/tompanos?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAADxAD8BixAo-jxT_PH2igWRcSAi-q13nOI","post":"EXPOSED: The 2 Biggest Lies of Million Dollar Agents.As an industry, we often have an unhealthy obsession with being a million dollar agent. Here are two things that may surprise you:\n1. They don't write the numbers on their own\n2. A million dollar agent can be broke\n\nWhat are your thoughts? Comment below and forward this to a colleague\n\n"},{"name":"James Ashford","title":"Founder of GoProposal® | Director of MAP. | Keynote Speaker | Bestselling Author of \"Selling to Serve\"","profile":"https://www.linkedin.com/in/jamesashford?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAALEZQMB-pKk3wvfEvpX1tlCriZf5t-S6No","post":"Just had a terrible car buying experience (or lack thereof.)\n\nWent to BUY a car (not look at one but actually buy one.)\n\nStood in the car garage for about 20 minutes and not one person acknowledged us. And when I say acknowledge, I mean not a smile, not a ‘hello’, not a ‘are you ok?’. Nothing.\n\nOne guy (looked like Mr. Burns for the Simpson’s) walked passed us three times without so much as a hello, but had time to stand watching rugby.\n\nMy kids made themselves drinks and got biscuits and we sat down for a while.\n\nIn the end I was embarrassed and said let’s go.\n\nWe all hear of retail stores shutting down and going under, and it’s because they fail to realise the importance of creating incredible experiences, that people deserve when they’ve given up part of their weekend to drive across town to see you.\n\nI can have a better experience than this online sat at home. And when robots/technology start to do a better job than you, you’ve become irrelevant and replaceable.\n\nWe have now moved into the "},{"name":"Voltacars - VRS","title":"672 followers","profile":"https://www.linkedin.com/company/5386584/?miniCompanyUrn=urn%3Ali%3Afs_miniCompany%3A5386584","post":"VRS is pleased to announce the appointment of Mohammed Ly as the new Manging Director of VRS Senegal.\n\nFollowing his extensive experience in the automobile sector in Europe and  Sub Saharan Africa, Mohammed is happy to join the VRS Africa pan-african adventure. \n\nThe entire VRS Africa team welcomes him and wishes him success in his new role.\n\n----------------------------------------------------------\n\nVRS Africa a le plaisir d’annoncer la nomination de Mohamed Ly en tant que nouveau Directeur Général de VRS Sénégal.\n\nMohamed, après une longue expérience dans le secteur automobile en Europe et en Afrique Sub Saharienne ), est heureux de s’associer à l’aventure panafricaine de VRS Africa.\n\nL’ensemble de l’équipe VRS Africa lui souhaite la bienvenue et beaucoup de succès dans sa prise fonction.\n"},{"entities":{"location":[{"confidence":0.92039,"value":"Las Vegas","resolved":{"values":[{"name":"Las Vegas","grain":"locality","type":"resolved","timezone":"America/Los_Angeles","coords":{"lat":36.174968719482,"long":-115.13722229004},"external":{"geonames":"5506956","wikidata":"Q23768","wikipedia":"Las Vegas"}},{"name":"Las Vegas","grain":"locality","type":"resolved","timezone":"America/Denver","coords":{"lat":35.593929290771,"long":-105.22389984131},"external":{"geonames":"5475433","wikidata":"Q676171","wikipedia":"Las Vegas, New Mexico"}},{"name":"Las Vegas","grain":"region","type":"resolved","timezone":"America/Tegucigalpa","coords":{"lat":14.866359710693,"long":-88.072326660156},"external":{"geonames":"8062439"}}]}}],"intent":[{"confidence":0.5645505536578,"value":"leasing_cars"}]},"msg_id":"1QCnd5h7E13Nx656o","name":"Hermann Brumm","title":"Remain humble, maintain a constant willingness to learn, and pursue righteously. The rest will follow.","profile":"https://www.linkedin.com/in/hermannbrumm?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAmAZ_MBN0ze5QlTCix1krxwkwjdMslhlGk","post":"We are pleased to announce that today marks seven days our company has operated in Las Vegas officially. Time Valued. Money Saved. Car Geeks. "},{"name":"Ashley Hazell","title":"Recruitment Manager at Oxbotica","profile":"https://www.linkedin.com/in/ajthazell?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAA4SilUB2i_Q3zTUkAtZQA8klqtDJF_4Fzg","post":"Small, affordable EVs are the future. This article makes the point that I have been saying for ages! You need to make EVs cheap to buy! \n\nI constantly see the argument that a Tesla will work out cheaper over 3/4/5 years. As true as that is, lots of people simply don't have thousands of pounds to stump up for a deposit, or want a £700pcm+ lease deal hanging over them like a cloud.\n\nIf the Uniti is offered with competitive financing, and handles well... Sign me up!\n\n"},{"name":"Schuyler Vorster","title":"Founder of Ideas Cartel","profile":"https://www.linkedin.com/in/schuylervorster?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAALYalcBfJ-amXlaIf3MN44zPEJUPHkPT8Y","post":"Take a ride down memory lane with me as I look back on how we grew from 50 sqm of coworking space in de Waterkant into a Hotel, Members Club and Coworking operation 🏨 \n\nIn the early days we realized that unique experiences and introductions drove business so we hired bikes and cars to bring people to visit us. This is the same mantra we live by today. In everything we do. “Is this unique?”\n\nWe realized very soon that there was a demand for coworking space and signed every lease we could find and started construction on our second site very nervous about life.\n\nAs Ideas Cartel Loop was funded by Waterkant we had to make sure we had to retain our current base and sign memberships off plan so we walked the site with potential members who are still with us today.\n\nOnce Loop was done we realized a lot of people need to have a great hotel and a solid bar offering - we built it :) this was by far the toughest to get over the line.\n\nThen came the Old Foundry, risky as the competitors have came rolling into CT & We knew We would find Work a little tougher, but realized that our core offering was different - we are a Work, Eat, Meet, Play and Stay member base.\n\nFour Pillars of "},{"name":"Stroohm","title":"803 followers","profile":"https://www.linkedin.com/company/12179091/?miniCompanyUrn=urn%3Ali%3Afs_miniCompany%3A12179091","post":"Gaat Volvo voor een nieuwe Lease Car of the Year? De full-electric XC40 'Recharge' is voorgesteld en is een fleet model om naar uit te kijken.\n\nHet 78kWh batterijpakket brengt je 320 kilometer ver. De 2 motoren geven je meer dan 400 pk. Dat is goed voor een sprintje 0-100km/u in 4,7 seconden.\n\nLaden kan je thuis aan 11kW en aan een snellader tot wel 150kW. Perfect te vergelijken met een Tesla Model 3 en Audi E-Tron.\n\nKies je volgende elektrische leasewagen via onze website "},{"name":"Sean Ugrin","title":"CEO & Founder at Spiffit","profile":"https://www.linkedin.com/in/seanugrin?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAAQI6oBEiCBZJE3t0LAiEQ5_ItHiCPn6VM","post":"- If you want to Sell it... Spiffit !\n\nPatrick Manzi, NADA Senior Economist spoke at the Colorado Auto Dealer Association Economic Forecast Dinner last night. Some of the highlights:\n\n- 74% of dealer profit is coming from F&I and Fixed Operations.\n- The average new car price is reaching $38K and the payment gap bewteen new and used vehicles has surpassed $150 p/mth.\n- The Variable opportunity is in used vehicles, supply remains strong as vehicles come off-lease.\n- Variable and Fixed incentives are going to increase. As a result, dealers are reliant on that below-the-line money every month.\n"},{"name":"Agustin Perret-Gentil, MBA","title":"COO - AmeriFinance | AmeriDrive - Mobility | TaaS | MaaS Expert","profile":"https://www.linkedin.com/in/agustin-perret-gentil-mba-908a857a?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAABDjhtgBdBnJt5EnYuLVHl08FW_OLKQrUDA","post":" "},{"entities":{"intent":[{"confidence":0.71220665294658,"value":"leasing_cars"}]},"msg_id":"1YeqbriBOP6GjOgu1","name":"Bill Bosco","title":"President at Leasing 101","profile":"https://www.linkedin.com/in/bill-bosco-393b1aa?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAHx-p8BT9bA2y2IFstCsPbKaV14Hyj3_ww","post":"\nFYI\nI wrote this article re the lease vs buy decision given new tax and accounting rules - the big change is that the lease vs buy decision should consider financial reporting issues now that all leases are on balance sheet\n \nIt is up on the Boomberg Tax site\n"},{"entities":{"contact":[{"suggested":true,"confidence":0.935775,"value":"Fort Worth","type":"value"}]},"msg_id":"1Vpm1TZ8oY8d28sCo","name":"Joel Brooks","title":"Media Production Services","profile":"https://www.linkedin.com/in/joel-brooks-aa27261b?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAQzVJoBoYuzNNbufxTuj-jYdCgrlNx0Uvo","post":"Honda of Fort Worth\n"},{"entities":{"contact":[{"suggested":true,"confidence":0.935775,"value":"Fort Worth","type":"value"}]},"msg_id":"1dMWjSsaMBh4ECTTK","name":"Joel Brooks","title":"Media Production Services","profile":"https://www.linkedin.com/in/joel-brooks-aa27261b?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAQzVJoBoYuzNNbufxTuj-jYdCgrlNx0Uvo","post":"Honda of Fort Worth\n"},{"name":"Frank Sinclair","title":"CEO (Chief Encouragement Officer) Dream Again LLC","profile":"https://www.linkedin.com/in/frank-sinclair-038722137?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAACFjc6wBU83Gn8Cp__FqtceyqXx3pipbnsA","post":"With "},{"entities":{"contact":[{"suggested":true,"confidence":0.88733,"value":"auto","type":"value"}]},"msg_id":"1oG0He9fm7xAVcEkx","name":"Andrea Dadas","title":"Global Head of Marketing-Governance, Risk, Investigations and Disputes at Duff & Phelps","profile":"https://www.linkedin.com/in/andrea-dadas-423a546?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAE5ClsBklCJKnJFoMfwMeiYYBha5f5xjz4","post":"\"Great news for the auto industry as 83% of millennial car owners expect to purchase or lease another car in the next five years,\" says "},{"name":"Amber O'Roke","title":"Northeast Corporate Recruiter at Penske Truck Leasing","profile":"https://www.linkedin.com/in/amber-o-roke-622bb8140?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAACJZeHoBT2UUu0ztgKH2HpLooIGAs4s4VXE","post":"Everyone, meet ⭐️Elizabeth AKA Ellie⭐️! Ellie is an Entry Level Diesel Technician in our Albany District for Penske Truck Leasing. Although she doesn’t have any family members that are mechanics, when she was younger, she watched her parents spend a lot of money repairing their car. That’s the moment she decided she wanted to be a technician. It’s a career that is needed so she will have job security and be paid well! She graduated from the Automotive Collision program at BOCES which helped her gain experience at small, local shops. She joined the Penske family in May of 2019. The best part about our company to her is the constant training that helps her sharpen her current skills, learn new skills and never get bored. The challenge is continuous! She would highly recommend Penske Truck Leasing to others. The advice she would give to new Diesel Mechanics at Penske would be (to), “confirm any questions with a Maintenance Supervisor. There’s always a correct way to repair, and resources are available to be successful.”\n\nWe’re happy to have you, Ellie, and can’t wait to see where your career at Penske takes you.\n\n➡️Are you a Technician looking for your next opportunity, or perhaps you know one who is? Message me today and let me know that you read Ellie’s story!"},{"entities":{},"msg_id":"1hDArpuVoXspXDG42","name":"Myles Lane","title":"VP of Finance at Notarize, Inc","profile":"https://www.linkedin.com/in/myles-lane-2971598?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAFyH1MBNdEIE6gvMx9sMyNac2kGZWwmaPc","post":"Come for the banter and stay for the hot "},{"name":"David Inman CCIM","title":"Real Estate Development","profile":"https://www.linkedin.com/in/david-inman-ccim-93757518?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAOkmfsB1RMbEbkgTIr99k3OxvKhss50Gxg","post":"The PEAKS CORPORATE PARK\n\nTHE CENTER OF IT ALL !!\n\nA 360 video of the amenities surrounding the Peaks in-fill location.\n\n \n\nGrey Shell Office Buildings for Sale\n\nWhy lease when you obtain all the benefits of ownership?\n \n* Offering WorkPark...an “outdoor” office environment / work tables / electrical outlets / Wi Fi\n\n*Modern designed grey shell units from 2,500sf to 15,000sf\n* +/- 5.5: 1000sf parking ratio (covered parking available)\n*Daily car traffic in excess of 6,000,000 per month !!!\n*One block from Summerlin, if you were any closer you would be paying their fees\n*Restaurants & Services in the immediate are too numerous to list\n \n\nContact Newmark Knight Frank: David Scherer / Jake Peevyhouse / Matt Kreft / Charles Van Geel @ 702 796 7900\nDeveloped by: Investment Equity Developers"},{"name":"Aidan Pierson","title":"Business Student at the University of Michigan-Dearborn | Community Assistant | Server | Sales and Management Enthusiast","profile":"https://www.linkedin.com/in/aidan-pierson-08a19416b?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAChtcGoBaTmpuYTK1KhJr0ri-nr2BwHH6GU","post":"Last month, I had the honor of introducing the first BBQ Car Show for both the Automotive Association at UM-Dearborn, and the Union at Dearborn! We had a great turnout, the event was more than a success. With over 250 people in attendance, 30 cars shown off, and securing two leases.. You can definitely count on us hosting more events like this in the future!"},{"name":"Lori Saitz","title":"Helping managers who send employees to conferences ensure their people come back with valuable connections | Workshops","profile":"https://www.linkedin.com/in/lorisaitz?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAABRlk0B66LD8AkbvTdN_62c718PRuEDYf4","post":"Chef Harv was killed in a car accident on Friday. \n\nI felt like I'd been kicked in the stomach and all the air had left my chest. \n\nNo! No! No! How is this even possible?!\n\nChef Harv and I had met only six months prior, introduced by a mutual associate.\n\nHe was the kind of person who was able to forge an instant and genuine connection with everyone. \n\nI had flown from Florida to his facility in West Virginia a few times to strategize on how he could bake and package the Gratitude Cookies for me, so I could focus more on marketing and selling. \n\nHe helped me with leasing this expensive cookie machine, imported from Germany, that would automate some of the process. \n\nThe first die for this machine hadn't been right, so we had to order another. \n\nIt was getting closer and closer to the holiday season, my busiest time of year. \n\nAnd he hadn't been able to test run the first batch yet. \n\nHe was finally doing that the last week of November. \n\nI was calling to see how it went when his right-hand man gave me the shocking news. \n\nDespite their immense loss, his incredible team still managed to fulfill my company's orders that season. \n\nSometimes the best laid plans go awry. \n\nHave you suffered a seemingly insurmountable situation in your business/career? \n\nHow did you prevail?"},{"entities":{"intent":[{"confidence":0.71179059910741,"value":"none"}]},"msg_id":"1ZXEXj3NRGAwiS022","name":"Shannon Peng","title":"Tech Enthusiast Turned Super Mom. Sr. Account Manager @ DGI. Helping Solve Company’s Complex Business Needs.","profile":"https://www.linkedin.com/in/shannonpeng?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAALTS2IBlznPXKWSPMdLw1m9HaieouJ_bg8","post":"🚗 Cars are the classic example of a depreciating asset. The minute you drive a new car off the lot, its value drops by about 20% and it will never again be worth what you paid for it.\n\n"},{"entities":{"location":[{"confidence":0.88080333333333,"value":"Cincinnati, Ohio","resolved":{"values":[{"name":"Cincinnati","grain":"locality","type":"resolved","timezone":"America/New_York","coords":{"lat":39.127109527588,"long":-84.514389038086},"external":{"geonames":"4508722","wikidata":"Q43196","wikipedia":"Cincinnati"}}]}}]},"msg_id":"1oKAO4FyRZDr6qL24","name":"Lars Nielsen","title":"Business Development Manager at Mike Albert Fleet Solutions","profile":"https://www.linkedin.com/in/lars-peter-nielsen?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAMXNZIBHWBmXONrpBww0kVdM7EpG7RarQM","post":"We began in 1928 as a small family-owned car lot in Cincinnati, Ohio. Today, we are a top 10 full-service fleet solutions partner. And we’re still a family-owned company, focused on honesty, integrity, and hard work. Read our story here: "},{"entities":{"location":[{"suggested":true,"confidence":0.87095,"value":"olumbus!","type":"value"},{"suggested":true,"confidence":0.851345,"value":"armel East ","type":"value"}]},"msg_id":"1o7gesRarMSWrh8SZ","name":"Jessica Costello","title":"Commercial Real Estate Agent at Roth Real Estate Group","profile":"https://www.linkedin.com/in/jessica-costello-52514427?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAWJne0BB2uo1nsN4HlD12t_C9iZGlWe_TM","post":"🏢⭐️ Great opportunity east of downtown Columbus! ⁣\n⁣\n• For sale or lease ⁣\n• 10,545 sq. ft of medical/office space ⁣\n• Zone C2⁣\n• 55,169 cars a day ⁣\n• Easy access to I-270 ⁣\n• Minutes to Mt. Carmel East ⁣\n⁣\nCall us now to schedule a showing! \n "},{"name":"Tony Syracuse","title":"Chief Commercial Officer at YES Leasing and Rogue Financial Group","profile":"https://www.linkedin.com/in/tony-syracuse?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAGZ7vkBstNWUpClehV2XJF401gLU8O-YDk","post":"When it comes to equipment financing, the term \"leasing\" can be confusing. Occasionally we have customers who think leasing equipment is like leasing a car. Just to set the record straight, it's not! Unlike leasing a car, equipment leases result in OWNERSHIP of the equipment at the end of the term. "},{"entities":{"contact":[{"suggested":true,"confidence":0.93043,"value":"Austin","type":"value"}],"intent":[{"confidence":0.54571316372506,"value":"leasing_cars"}]},"msg_id":"1OlqDNZBSRtWgEq7f","name":"Ryan Wingate","title":"Internet Sales Manager at Volvo Cars of Austin","profile":"https://www.linkedin.com/in/srw1994?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAACzL2oBfsIWDYLCh8WVqpyt3A2QiQ04-lY","post":"Volvo Cars of Austin has an awesome inventory right now!  We are really primed for going into the Fall and Winter selling seasons. A great example is this 2020 model year XC90 T6 Inscription, MSRP $75,790.00. Lease this car today, call me for an aggressive proposal! "},{"name":"Jeff Fisher","title":"Agency Owner at Jeff Fisher Agency","profile":"https://www.linkedin.com/in/jeff-fisher-10743013?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAK7k5cBDfY8MR1wd1BrunTMYkZqTN7awIE","post":"The moment your vehicle leaves the lot, its value rapidly depreciates. That means if you were to get into an accident and your car’s a total loss, your auto policy will generally pay for the vehicle’s actual cash value – which might be less than what you still owe on your lease or loan. That’s where lease/loan gap insurance can help."},{"entities":{"contact":[{"suggested":true,"confidence":0.86289,"value":"Tarry Shebesta","type":"value"}],"location":[{"suggested":true,"confidence":0.87037,"value":"truPayments","type":"value"},{"suggested":true,"confidence":0.88381,"value":"LLC","type":"value"}]},"msg_id":"18GaKu7bWY8e0hNN5","name":"Tarry Shebesta","title":"CEO, truPayments, LLC - 30 Year Anniversary of Selling Cars Online","profile":"https://www.linkedin.com/in/tarry-shebesta-49a3687?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAFMcrYByqNLls29RFWe0lG8nSgZhUUu0jM","post":"FOR IMMEDIATE RELEASE\n\nTarry Shebesta of truPayments, LLC to Speak at "},{"name":"Jack Kelly","title":"Founder and CEO of WeCruitr","profile":"https://www.linkedin.com/in/jackkellycsg?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAADzii4BIoNZvytprYuVah4xHF9AOgosxqw","post":"\nEarning $100,000 Used To Mean Something. Now, You Can Barely Afford To Buy A Home—Here’s The Big Problem\n\nFor many people, when we were starting out in our careers, earning a six-figure salary was the ultimate goal. If you made $100,000 or more, you were considered relatively successful. The compensation would afford you the opportunity to fulfill the American dream—owning a home with a white picket fence in a lovely neighborhood with good schools for when you have children. Fast forward to today and it has all changed.\n\nAccording to the Wall Street Journal, there is a growing trend of $100k-earning professionals electing to rent instead of purchasing homes. Almost 20% of households earning $100k or more are bucking historical norms and renting apartments.  \n\nHere’s why this trend is an issue. The reasons for renting—compared to buying a home—are complex. Due to exceedingly high student loan debt, burdensome personal expenses (such as insurance and healthcare costs), leased cars, credit card debt, smartphones, utility bills and other expenses have made it difficult for potential buyers to save enough for the down payments on a home.\n\nRenters will continue to pay off student, their monthly rent and all other expenses. It will be a .. Read the full article: "},{"entities":{"location":[{"confidence":0.9323,"value":"Denver","resolved":{"values":[{"name":"Denver","grain":"locality","type":"resolved","timezone":"America/Denver","coords":{"lat":39.739151000977,"long":-104.98470306396},"external":{"geonames":"5419384","wikidata":"Q16554","wikipedia":"Denver"}},{"name":"Denver County","grain":"region","type":"resolved","timezone":"America/Denver","coords":{"lat":39.76203918457,"long":-104.87635040283},"external":{"geonames":"5419396","wikidata":"Q15906757"}}]}}],"intent":[{"confidence":0.86239039156929,"value":"none"}]},"msg_id":"1lJ7TPNjCidjVflUp","name":"John T. Hildebrandt","title":"Corporate Fleet Management: Creating Efficiencies and Improving Margins","profile":"https://www.linkedin.com/in/john-t-hildebrandt-b9647730?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAZ53OIBM02Fev22E2Rkq_OAi2fBd0K05Ds","post":"With Winter rapidly approaching now is the right time to ensure you and your car are prepared. As we saw in Denver last week, just a couple inches of snow can make your normal commute miserable if your car is isn't in the right shape."},{"name":"Michael Weber (312-953-2193)","title":"Senior Commercial Broker at @ Properties / mweber@atproperties.com (16k+ connections)","profile":"https://www.linkedin.com/in/michael-weber-312-953-2193-6bb0804?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAC4y-8BKpTw7ILZ9ZkdFUfmQAh2UYFvkVU","post":"\nPerfect Location for your business!!!!!\nFor Sale in Lincoln Park \n3 story mixed use building\n2014 N. Halsted (Chicago, IL. 60614)\n\n2nd and 3rd floor units run as Airbnb and rented consistently and making great money! \n\nBoth units loft style 2 bedrooms\n1st floor retail leased to jewelry store but will vacate upon sale\nRetail space is approx. 1300 Sq. Ft.\nAbility to park three cars in the rear or expand retail level for larger storefront\n\nNeighborhood: Located 2 blocks to brown line and 4 blocks to red line L stop, less than a mile to Kennedy expressway and Lake Shore drive, bus stops north and south out front and Divvy station within half block\n\nArea tenants include: Summerhouse, Blue Door farm Kitchen, Interior define, Walgreens, Bonobos, Warby Parker, Café-Baba-reba, Lori’s shoes, Barry’s boot Camp and much more\nSteps from Lincoln Park High School\n\nZoned B2-2\n25x125 lot (3125 Sq. Ft.)\n2017 Taxes - $23,210\nPrice: Upon Request"},{"name":"Paul Aldaz","title":"CEO Stellar Auto Sourcing","profile":"https://www.linkedin.com/in/paul-aldaz-29472238?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAfwBRABdVZWBKk9YlKsH9dQOjMxMMgiCNU","post":"“EXCLUSIVE STELLAR DEALS”\n\nLEASE FOR $989 Plus Local Taxes \n\n2019 BMW I8 COUPE \nMSRP $149,495\nWHITE/ BLACK \n\n7.5K MILES PER YEAR\n24 MONTH LEASE \n\n***MUST HAVE BMW LOYALTY***\n\n0 DOWNPAYMENT \n\n***$0 DOWN PAYMENT REQUIRED (capitalized cost reduction). Excludes taxes, bank fee, 1st month’s payment, dealer doc fee and applicable motor vehicle charges. $0 Security Deposit. Includes all available rebates. Subject to tier 1 credit approval, not all will qualify. Contact us for complete details. Images shown for illustration purposes only, only one car at this price. No liability can be held for any errors, typos, however caused, to any recipients of this message***"},{"name":"Michael Weber (312-953-2193)","title":"Senior Commercial Broker at @ Properties / mweber@atproperties.com (16k+ connections)","profile":"https://www.linkedin.com/in/michael-weber-312-953-2193-6bb0804?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAC4y-8BKpTw7ILZ9ZkdFUfmQAh2UYFvkVU","post":"HUGE PRICE REDUCTION!!!\nLakeview Mixed Use Building – For Sale!!!!!\nGreat opportunity to run your business, great in place CASH FLOW and value add investment with chance to push the rents. \n\n5 unit fully leased investment property ( 4 apt + 1 store)\n4 residential units ( 2 - 2bed/1bath, 1 - 3 bed/2 bath and 1 - 4 bed/2 bath)\n\nHardwood floor through each unit\nLaundry in unit or available for all tenants\nSome units with fireplaces\nLarge common roof deck for tenants use\n1 retail space with café tenant\nFull basement below retail space\n2 car garage\nBack deck/exterior stairs recently replaced\nAmazing value add opportunity with huge rental upside\n\nCentrally located walking distance to Walgreens, Whole Foods and Target among local restaurants and shops\n\n4 Blocks to Paulina Brown Line Stop\n\nBus and Divvy directly out front and easy access to Kennedy Expressway\n\nLot Size – 26.5 x 125\nZoned – B1-3\n2018 Taxes - $15,915\n\nAlderman / Ward – Matthew J. Martin / 47th\nPrice – Upon Request"},{"name":"Marco A. Garcia","title":"Insurance Broker - Business - Home - Auto - Umbrella - Toys (623) 759-7737","profile":"https://www.linkedin.com/in/marcogarciainsurance?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAD2SgcB5qImBT6cYMesDtpWqJsnbRrqwPI","post":"Insurance 101 - Part 6\nWHAT IS FULL COVERAGE AUTO INSURANCE? \n\nIn many cases that means only mandatory liability insurance, plus comprehensive and collision. (See previous posts on these coverages). However, \"full coverage” must be customized and be appropriate for your specific financial situation, also considering your risk level and assets. \n\nDoes “full coverage” protect you 100% against all risks? It doesn’t. For example, mandatory liability doesn’t cover you, or people riding with you, who may get hurt when involved in an accident. This coverage comes under Medical Payments (or Med Pay). \n\nWhat about you being hit by someone without insurance or someone who is underinsured? Yet again, not covered by a \"basic full coverage”. Lease or loan pay off? Nope. You will need to buy what is generally called “GAP” insurance for this. Glass breakage? Car rental? Towing? Etc? You will need to examine your policy to know if you are protected. \n\nAlways rely on a licensed professional to walk you through your current or future coverage. \n\nMarco Garcia, Insurance Broker\n\nLICENSED IN ARIZONA\n\n"},{"name":"Stephen Schattner","title":"President, Owner of Real Estate Development, Construction, Ag Sciences","profile":"https://www.linkedin.com/in/stephen-schattner-03648635?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAdd8KoBR_RfHxXjkNXimx2Ix0PZMllb30k","post":"IMPERIUM: Weatherford Town Square - US 51 at US 80, Weatherford, Texas - 60% preleased.  ONE ENDCAP RESTAURANT SPACE WITH MULTI-TERRACED ROOFTOP PATIO, 7,400 SF  REMAINING.  Stay tuned for the announcement of the restaurants that are joining and opening in 2020 in Units 103, 107 and 109.  Downtown foot traffic and 40,000 cars passing by at 20 mph daily make this a recognizable spot and family-friendly venue for breakfast, lunch and dinner.  Are you ready for a margarita watching the sunset, overlooking the town square, and listening to soft jazz under the stars from the rooftop patio? THEN CALL ME BEFORE THIS LAST SPACE LEASES.  Stephen Schattner 972-385-1907 ext 301\n\nProperty flyer: "},{"name":"Michael Cohen","title":"Realtor at Compass / BRE # 01522253","profile":"https://www.linkedin.com/in/westsidebymike?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAF7DzMBpuhGcfjFBFBDVOb8GZgLcDmC5DE","post":"For lease at $3,150 a month a completely brand new two bedroom 1 bathroom unit in duplex that feels like your own home with a private front gate with key entry and one controlled access one car garage. Featuring hardwood floors, porcelain tiles in the kitchen and bathroom, quartz stone kitchen counter tops, washer/dryer, stainless steel oven, hood fan, stove, and dishwasher. Soft close custom shaker style cabinetry, beveled tile backsplash, central a/c and heat, secured private entrance and exit, dual pane windows, noritz tankless water heaters, tiled shower with glass roller entry doors, and bathroom medicine cabinet."},{"name":"Brandon Schwertner","title":"Founder & Managing Partner | Teleios Commodities| Delivering Energy Transformation","profile":"https://www.linkedin.com/in/brandon-schwertner-28a7988b?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAABMo1IoBuTLlgJ0n8jqyNchNOeoqOSK0S9k","post":"When modern, highway capable electric cars began to rise in popularity in the early 00’s, they had a reputation for being slow and boring to drive. Today,: 9 of the 30 fastest cars in the world over a quarter mile are now all-electric or hybrids. The two cars with the fastest 0 – 60 time are all-electric or hybrid.\n\n"},{"name":"Matt Calloway","title":"Frisco, TX Real Estate expert | MBC Development, LLC| William Davis Real Estate, LLC | Commercial / Residential | Pilot","profile":"https://www.linkedin.com/in/mattcalloway?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAQn99kBCW_OlpyutBKEmQ22kLl2IlOyv_0","post":"Sick of seeing just another boring strip mall restaurant site for lease in Frisco,TX?  If so, Check out the 3,600 sq ft 2 story end cap WITH 1,700 sq ft rooftop patio we have available in the Downtown Frisco Rail District!!! The Rail District is becoming a Foodie haven and This is the PRIME spot in the Patios At the Rail project.  Delivery in Jan 2020.  The 1st floor has 22 ft ceiling heights with a 2nd floor roofdeck overlooking Main st! THIS is a destination with parking garage, 30k cars a day, 4 way lit intersection. BE SEEN!  Message me for pricing.  Generous TI. "}]}
